Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The problem here is that both the group named C<< a >> and the group named C<< b >> are aliases for the group belonging to C<< $1 >>.
es_es: El problema aquí es que tanto el búfer nominado C<< a >> como el grupo nominado C<< b >> son alias del grupo perteneciente a C<< $1 >>.

source: When used with C<.>, the repeat count determines the starting position to calculate the value offset as follows:
es_es: Cuando se utiliza con C<.>, el número de repeticiones determina la posición de partida para calcular el valor de desplazamiento de la siguiente manera:

source: LABEL foreach VAR (LIST) BLOCK continue BLOCK
es_es: ETIQUETA foreach VAR (LIST) BLOQUE continue BLOQUE

source: The arguments are interpreted as follows: if a given argument is numeric, the argument is passed as an int.
es_es: Los argumentos se interpretan de la siguiente manera: si un argumento dado es numérico, el argumento se pasa como un int.

source: Perl is flexible and extensible enough for you to use on virtually any task, from one-line file-processing tasks to large, elaborate systems.
es_es: Por su flexibilidad y capacidad de ampliación, Perl se puede usar prácticamente para cualquier tarea, desde el procesamiento de archivos en una línea hasta el desarrollo de sistemas grandes y complejos.

source: do_something;
es_es: hacer_algo;

source: However, Unicode is in the process of reconsidering and revising their recommendations.
es_es: Sin embargo, Unicode se encuentra en el proceso de reconsideraciones y revisando sus recomendaciones.

source: print $foo, exit; # Nor is this.
es_es: print $foo, exit; # Tampoco esto.

source: Windows-specific tests.
es_es: Pruebas específicas de Windows.

source: Perl defines the following zero-width assertions: X<zero-width assertion> X<assertion> X<regex, zero-width assertion> X<regexp, zero-width assertion> X<regular expression, zero-width assertion> X<\b> X<\B> X<\A> X<\Z> X<\z> X<\G>
es_es: Perl define las siguientes aserciones de ancho cero: X<zero-width assertion> X<assertion> X<regex, zero-width assertion> X<regexp, zero-width assertion> X<regular expression, zero-width assertion> X<\b> X<\B> X<\A> X<\Z> X<\z> X<\G> X<aserción ancho cero> X<aserción> X<regex, aserción ancho cero> X<regexp, aserción ancho cero> X<expresión regular, aserción ancho cero>

source: All text strings are in this internal format.
es_es: Todas las cadenas de texto tienen este formato interno

source: For the reverse, use L</ord>.
es_es: Para lo contrario, use L</ord>.

source: The C<:encoding(...)> layer implicitly introduces the C<:utf8> layer.
es_es: La capa C<:encoding(...)> implícitamente introduce la capa C<:utf8>.

source: * text-mode STDIO
es_es: * modo texto en STDIO

source: Andy Lester supplied many improvements to determine which function parameters and local variables could actually be declared C<const> to the C compiler.
es_es: Andy Lester suministró muchas mejoras para determinar qué parámetros de las funciones y qué variables locales podrían realmente ser declaradas C<const> para el compilador de C.

source: =head2 Testing Anomalies of Perl on VM/ESA
es_es: =head2 Probando anomalías de Perl en VM/ESA

source: The "CR CR LF" problem of has been fixed, binmode(FH, ":crlf") is now effectively a no-op.
es_es: El problema "CR CR LF" ha sido fijado, binmode(FH ":crlf") es ahora, efectivamente, una no-operación.

source: The special string C<"0 but true"> is exempt from B<-w> complaints about improper numeric conversions.
es_es: La cadena especial C<"0 but true"> (0, pero verdadero) es una excepción de los mensajes de aviso activados por B<-w> sobre una conversión numérica impropia.

source: This can be useful for displaying ordinal values of characters in arbitrary strings:
es_es: Esto puede ser útil para mostrar los valores ordinales de caracteres en cadenas arbitrarias:

source: The notation is C<(?E<lt>I<name>E<gt>...)> to declare and C<\g{I<name>}> to reference.
es_es: La notación es C<(?E<lt>I<nombre>E<gt>...)> para declararlo y C<\g{I<nombre>}> para referirse a él.

source: Perl extensions on Windows now can be statically built into the Perl DLL, thanks to a work by Vadim Konovalov.
es_es: Extensiones Perl en Windows pueden ahora ser estáticamente compiladas en Perl DLL, gracias al trabajo de Vadim Konovalov.

source: ($file) = <blurch*>;
es_es: ($archivo) = <loquesea*>;

source: =head2 C-style Logical And X<&&> X<logical and> X<operator, logical, and>
es_es: =head2 And lógico al estilo del C X<&&> X<logical and> X<operator, logical, and> X<and lógico> X<operador, lógico, and>

source: X<hash, scalar context> X<hash, bucket> X<bucket>
es_es: X<hash, scalar context> X<hash, contexto escalar> X<hash, bucket> X<hash, cajones> X<bucket> X<cajones>

source: The constructor now knows which module implements SHA-224
es_es: El constructor ahora sabe qué módulo implementa SHA-224

source: $n = 01234; # octal integer
es_es: $n = 01234; # entero octal

# eval " #line " . __LINE__ . ' "' . __FILE__ ."" die 'foo'";
source: eval "\n#line " . __LINE__ . ' "' . __FILE__ ."\"\ndie 'foo'";
es_es: eval "\n#línea " . __LINE__ . ' "' . __FILE__ ."\"\ndie 'foo'";

source: For instance, splice() has three scalar arguments followed by a list, whereas gethostbyname() has four scalar arguments.
es_es: Por ejemplo, splice() tiene tres argumentos escalares seguidos por una lista, mientras que gethostbyname() tiene cuatro argumentos escalares.

source: This means that C<\x7> will be interpreted as C<\x07>, and a lone <\x> will be interpreted as C<\x00>.
es_es: Esto significa que C<\x7> será interpretado como C<\x07>, y un único C<\x> será interpretado como un C<\x00>.

source: # we'll build auxiliary indices instead
es_es: # construiremos índices auxiliares

source: perlrebackslash Perl regular expression backslash sequences
es_es: perlrebackslash Secuencias de escape en expresiones regulares

source: (As the inner C<$x> is and has always referred to C<$::x>)
es_es: (Debido a que la variable interna C<$x> es y siempre es referida como C<$::x>)

source: See how much easier this is?
es_es: ¿Ha visto que es mucho más fácil?

source: print ++($foo = "Az"); # prints "Ba"
es_es: print ++($foo = "Az"); # imprime "Ba"

source: If the length of the input string is not evenly divisible by 8, the remainder is packed as if the input string were padded by null characters at the end.
es_es: Si la longitud de la cadena de entrada no es divisible por 8, el resto se rellena como si la cadena de entrada estuviera completada con caracteres nulos hasta el final.

source: $a =~ s/foo/bar/; # replaces foo with bar in $a
es_es: $a =~ s/foo/bar/; # reemplaza foo por bar en $a

source: Just run ./Configure script from the top directory.
es_es: Sólo tiene que ejecutar el script ./Configure desde el directorio principal.

source: Each operator and function decides which sort of value would be most appropriate to return in scalar context.
es_es: Cada operador y función decide qué clase de valor será más apropiado para devolver en contexto escalar.

# newline (LF, NL)
source: \n newline (LF, NL)
es_es: \n nueva línea (LF, NL)

source: For example, E-mail and HTTP support MIME headers, so you can use the C<Content-Type> header.
es_es: Por ejemplo, el correo electrónico y HTTP son compatibles con los encabezados MIME, por lo que puede usar el encabezado C<Content-Type>.

source: A number of popular modules are included with the Perl distribution itself.
es_es: La distribución de Perl incluye muchos módulos populares.

source: left * / % x
es_es: izquierda * / % x

source: -s File has nonzero size (returns size in bytes).
es_es: -s Archivo no tiene tamaño cero (devuelve el tamaño en bytes).

source: select(REPORT1);
es_es: select(INFORME1);

source: (For blessed references, the "Object" entries apply.)
es_es: (Para referencias bendecidas, se aplica la entrada "Objeto")

source: =item use VERSION
es_es: =item use VERSIÓN

source: Object Any invokes ~~ overloading on $object, or falls back:
es_es: Objeto Cualquiera invoca ~~ sobrecargado en $objeto, o termina:

source: See L<perlsub> and L<perlref> for details about subroutines and references; see L<attributes> and L<Attribute::Handlers> for more information about attributes.
es_es: Vea L<perlsub> y L<perlref> para los detalles acerca de subrutinas y referencias; vea L<attributes> y L<Attribute::Handlers> para obtener más información acerca de los atributos.

source: If you assign something shorter than LENGTH, the string will shrink, and if you assign something longer than LENGTH, the string will grow to accommodate it.
es_es: Si asigna algo más corto que LONGITUD, la cadena se reducirá, y si asigna algo más largo que LONGITUD, la cadena crecerá para acogerlo.

source: Named backreference.
es_es: Referencia inversa nominada.

source: See L<perlrun/PERL_SIGNALS> and L<perlipc/"Deferred Signals (Safe Signals)">.
es_es: Vea L<perlrun/PERL_SIGNALS> y L<perlipc/"Señales diferidas (Acceso seguro a señales)">.

source: Similarly, a list assignment in list context produces the list of lvalues assigned to, and a list assignment in scalar context returns the number of elements produced by the expression on the right hand side of the assignment.
es_es: Del mismo modo, una asignación de lista en contexto de lista produce la lista de I<ivalores> asignados, y una asignación de lista en contexto escalar devuelve el número de elementos producidos por la expresión en el lado derecho de la asignación.

source: =item next LABEL X<next> X<continue>
es_es: =item next ETIQUETA X<next> X<continue>

source: =head2 The C<$*> variable has been removed
es_es: =head2 La variable C<$*> ha sido eliminada

source: =item setnetent STAYOPEN
es_es: =item setnetent SIGUEABIERTO

source: This allows one to define subpatterns which will be executed only by the recursion mechanism.
es_es: Esto permite definir sub-patrones que serán ejecutados sólo mediante el mecanismo de la recursión.

source: # NOTE: The examples above featuring "W" and "c" are true
es_es: # NOTA: Los ejemplos anteriores de "W" y "c" son correctos

source: Contains links to information for module authors.
es_es: Contiene enlaces de información para los autores de módulos.

source: my $null = substr $name, 6, 2; # returns "" (no warning)
es_es: my $nulo = substr $nombre, 7, 2; # devuelve "" (sin advertencia)

source: Return value of -1 indicates a failure to start the program or an error of the wait(2) system call (inspect $!
es_es: El retorno de valor de -1 indica un error en el arranque del programa o un error de la llamada al sistema wait(2) (inspeccionar $!

source: If the REPLACEMENTLIST is empty, the SEARCHLIST is replicated.
es_es: Si la LISTA_REEMPLAZO está vacía, la LISTA_BÚSQUEDA es replicada.

source: The results end up in C<$1>, C<$2> and so on.
es_es: Los resultados se almacenan en C<$1>, C<$2>, etc.

source: This is useful for throwing away some of the return values of a function:
es_es: Esto es útil para descartar algunos de los valores de retorno de una función:

source: The C<a>, C<A>, and C<Z> types gobble just one value, but pack it as a string of length count, padding with nulls or spaces as needed.
es_es: Los tipos C<a>, C<A>, y C<Z> absorben un solo valor, pero se empaqueta como una cadena de longitud indicada, rellenada con nulos o espacios según sea necesario.

source: You could write the last two using the C<-u> and C<-d> operators.
es_es: Podría escribir las dos últimas utilizando los operadores C<-u> y C<-d>.

source: If and only if the input symbol is the only thing inside the conditional of a C<while> statement (even if disguised as a C<for(;;)> loop), the value is automatically assigned to the global variable $_, destroying whatever was there previously.
es_es: Si y sólo si el símbolo de entrada es la única cosa dentro de la condición de una instrucción C<while> (incluso si está disfrazado como un bucle C<for(;;)>), el valor es automáticamente asignado a la variable global $_, destruyendo su valor anterior.

source: The numbering within each branch will be as normal, and any groups following this construct will be numbered as though the construct contained only one branch, that being the one with the most capture groups in it.
es_es: La numeración dentro de cada rama será la normal, y cualquier grupo después de esta construcción se numerará como si la construcción contuviera una sola rama, que es la que tiene más grupos de captura dentro de si.

source: Just understand that older releases will choke on it during compilation.
es_es: Sólo entienda que las versiones anteriores de Perl se ahogarán en él durante la compilación.

source: =head1 INTRODUCTION
es_es: =head1 INTRODUCCIÓN

# print "Readable " if -r _;
source: print "Readable\n" if -r _;
es_es: print "Leíble\n" if -r _;

source: The C<< <*.c> >> operator is discussed in more detail in L<perlop/"I/O Operators">.
es_es: El operador C<< <*.c> >> se discute con más detalle en L<perlop/"Operadores E/S">.

source: by Tim Jenness and Simon Cozens
es_es: Tim Jenness y Simon Cozens

source: =item undef EXPR X<undef> X<undefine>
es_es: =item undef EXPR X<undef> X<undefine> X<indefine>

source: =item write FILEHANDLE X<write>
es_es: =item write IDENTIFICADOR_ARCHIVO X<write>

source: \L lowercase all characters till \E seen
es_es: \L minúsculas hasta encontrar \E

source: Until the C<(*PRUNE)> verb is reached, A may backtrack as necessary to match.
es_es: Hasta que el verbo C<(*PRUNE)> se alcance, A puede volver atrás tanto como sea necesario para que se produzca la coincidencia.

source: This 'cheat sheet' is a handy reference, meant for beginning Perl programmers.
es_es: Esta 'hoja resumen' es una referencia útil para programadores principiantes.

source: However, those functions will not be compiled in if you add C<-DNO_MATHOMS> in the compiler flags.
es_es: Sin embargo, esas funciones no serán compiladas si agrega C<-DNO_MATHOMS> en las opciones del compilador.

source: perlbook Perl book information
es_es: perlbook Información sobre libros de Perl

source: This uses a new warnings category: "imprecision".
es_es: Utiliza una nueva categoría de advertencias: "imprecision".

source: printf '<%g>', 100; # prints "<100>"
es_es: printf '<%g>', 100; # imprime "<100>"

source: There are a couple of special arrays too, such as C<@ARGV> (the command line arguments to your script) and C<@_> (the arguments passed to a subroutine).
es_es: También hay dos arrays especiales: C<@ARGV> (los argumentos de línea de comandos pasados al script) y C<@_> (los argumentos pasados a una subrutina).

source: is the moral equivalent of these two:
es_es: es el equivalente moral de estos dos:

source: C<scrolling_list()> select attribute fixed
es_es: Arreglado el atributo para select en C<scrolling_list()>

source: You could also read C<$^A> and then set C<$^A> back to C<"">.
es_es: Puede también leer C<$^A> y volver a ponerla otra vez a C<"">.

source: Argument processing and value returned work just like C<ioctl> below.
es_es: El procesado de argumentos y el valor devuelto funcionan como C<ioctl>.

source: =head2 Other interesting, non-Perl books
es_es: =head2 Otros libros interesantes (no específicos de Perl)

source: These override the normal built-ins, supplying versions that return objects with the appropriate names for each field.
es_es: Estas sobreescriben a las integradas, con versiones que devuelven objetos con los nombres apropiados para cada campo.

source: 2000 Irix 6.2 Posix 1003.1b support modules
es_es: 2000 Irix 6.2 Posix 1003.1b soporte de módulos

source: If you know I<exactly> what you're doing, you can use the C<< > >> or C<< < >> modifiers to force big- or little-endian byte-order on floating-point values.
es_es: Si sabe I<exactamente> lo que está haciendo, puede usar los modificadores C<< > >> o C<< < >> para forzas una ordenación de bytes de los valores.

source: Thus C<(?-1)> refers to the most recently declared group, and C<(?+1)> indicates the next group to be declared.
es_es: Así C<(?-1)> se refiere al grupo declarado más recientemente, y C<(?+1)> se refiere al siguiente grupo a ser declarado.

source: =item abs VALUE X<abs> X<absolute>
es_es: =item abs VALOR X<abs> X<absolute> X<absoluto>

source: the C<..> and C<...> flip-flop operators.
es_es: los operadores biestables C<..> y C<...>.

source: Truncates the file opened on FILEHANDLE, or named by EXPR, to the specified length.
es_es: Trunca el archivo abierto en IDENTIFICADOR_ARCHIVO, o nombrado por EXPR, a la longitud especificada.

source: Win32: fix bugs in handling of the virtualized environment
es_es: Win32: errores arreglados en el manejo de entornos virtualizados

# print "The value of $key is $hash{$key} ";
source: print "The value of $key is $hash{$key}\n";
es_es: print "El valor de $clave es $hash{$clave}\n";

source: Earlier releases interpreted the bareword as a directory name.
es_es: Versiones anteriores interpretaban la palabra sencilla como un nombre de directorio.

source: Be careful when using the branch reset pattern in combination with named captures.
es_es: Tenga cuidado al utilizar el patrón de reinicio de rama en combinación con la captura nominal.

source: The following compound statements may be used to control flow:
es_es: Las siguientes instrucciones compuestas pueden ser usadas para controlar el flujo:

source: Once you have Perl installed, a wealth of documentation is available to you through the 'perldoc' tool.
es_es: Una vez que haya instalado Perl, tendrá disponible una gran cantidad de documentación a través de la herramienta 'perldoc'.

source: There is one minor difference: if variables are declared with C<my> in the initialization section of the C<for>, the lexical scope of those variables is exactly the C<for> loop (the body of the loop and the control sections).
es_es: Hay una pequeña diferencia: si hay variables declaradas con C<my> en la sección de inicialización del C<for>, el ámbito léxico de estas variables es exactamente el bucle C<for> (el cuerpo del bucle y las secciones de control).

source: =item substr EXPR,OFFSET,LENGTH,REPLACEMENT
es_es: =item substr EXPR,DESPLAZAMIENTO,LONGITUD,REEMPLAZO

source: $pattern = "(?i)foobar";
es_es: $patron = "(?i)foobar";

source: The index function searches for one string within another, but without the wildcard-like behavior of a full regular-expression pattern match.
es_es: La función index busca por un string dentro de otro, pero sin tener el comportamiento de un sistema de coincidencias basado en expresiones regulares.

source: Mark Klein provided a fixed sigsetjmp (that works with dynamic libraries) in mpeix_setjmp.c
es_es: Mark Klein proporcionó un arreglo para sigsetjmp (que trabaja con bibliotecas dinámicas) en mpeix_setjmp.c

source: If you want to change the installation directory or have a standard DG/UX with C compiler GCC-2.7.2.x then you have no choice than to do an interactive build by issuing the command:
es_es: Si desea cambiar el directorio de instalación o tiene una DG/UX estándar con un compilador de C GCC-2.7.2.x, entonces no tiene más remedio que hacer una compilación interactiva mediante la ejecución de la orden:

source: This is a new lexically-scoped alternative for the C<Fatal> module.
es_es: Es una nueva alternativa de ámbito léxico para el módulo C<Fatal>.

source: C subroutines (or comparably compiled subroutines in other languages) supplied by you and linked into this Package in order to emulate subroutines and variables of the language defined by this Package shall not be considered part of this Package, but are the equivalent of input as in Paragraph 6, provided these subroutines do not change the language in any way that would cause it to fail the regression tests for the language.
es_es: Subrutinas en C (o, comparativamente, subrutinas compiladas en otros lenguajes) suministradas por usted y vinculadas a este Paquete con el fin de emular a subrutinas y variables del lenguaje definido por este Paquete no se considerarán parte de este Paquete, sino que son el equivalente a lo indicado en el apartado 6, siempre que estas subrutinas no cambien el lenguaje de cualquier manera que pudieran hacer fracasar las pruebas de regresión para el lenguaje.

# print("$name ");
source: print("$name\n");
es_es: print("$nombre\n");

source: In many systems the C<O_EXCL> flag is available for opening files in exclusive mode.
es_es: En muchos sistemas la bandera C<O_EXCL> está disponible para abrir archivos en modo exclusivo.

source: In other words, it must match C</^[_A-Za-z][_A-Za-z0-9]*\z/> or its Unicode extension (see L), though it isn't extended by the locale (see L<perllocale>).
es_es: En otras palabras, debe coincidir con C</^[_A-Za-z][_A-Za-z0-9]*\z/> o su extensión Unicode (ver L), aunque no esté ampliada por la configuración regional (ver L<perllocale>).

source: Using a regular C<foreach> loop for this purpose would be clearer in most cases.
es_es: El uso de un bucle C<foreach> normal para este propósito sería más claro en la mayoría de los casos.

source: You may have only one C<study> active at a time: if you study a different scalar the first is "unstudied".
es_es: Sólo puede tener una C<study> activa a la vez: si usted estudia un escalar diferente, la primera queda "sin estudiar".

source: push @caps, uc($_);
es_es: push @mayusculas, uc($_);

source: For constructs with three-part delimiters (C<s///>, C<y///>, and C<tr///>), the search is repeated once more.
es_es: Para construcciones con delimitadores en tres partes (C<s///>, C<y///>, y C<tr///>), la búsqueda se repite una vez más.

source: Tools exist to help you to build your module in a MakeMaker-friendly style.
es_es: Existen herramientas para ayudarle a construir su módulo en un estilo MakeMaker.

source: Tests for core modules in the F<lib/> directory are right next to the module itself.
es_es: Las pruebas de los módulos del núcleo del directorio F<lib/> se encuentran junto al módulo correspondiente.

source: You can determine your system endianness with this incantation:
es_es: Puede determinar la ordenación de bytes de su sistema con este conjuro:

source: s A signed short (16-bit) value.
es_es: s Un valor de un corto con signo (16 bit).

source: Note that this means that the contents of capture groups defined inside an eval'ed pattern are not available outside of the pattern, and vice versa, there is no way for the inner pattern to refer to a capture group defined outside.
es_es: Tenga en cuenta que esto significa que los contenidos de los grupos de captura definidos dentro de un patrón evaluado no están disponibles fuera del patrón, y viceversa, no hay manera de que el patrón interno se refiera a un grupo de captura definido fuera.

source: =head2 Your new toolkit
es_es: =head2 Su nuevo kit de herramientas

source: The result is the character specified by the hexadecimal number between the braces.
es_es: El resultado es el carácter especificado por el número hexadecimal entre las llaves.

source: There is no decrypt function.
es_es: No existe la función decrypt.

source: printf '<%#.5o>', 012345; # prints "<012345>"
es_es: printf '<%#.5o>', 012345; # imprime "<012345>"

source: =head2 Multiplicative Operators X<operator, multiplicative>
es_es: =head2 Operadores multiplicativos X<operator, multiplicative> X<operador, multiplicativo>

source: # The below doesn't match, and it isn't clear what $1 and $2 would
es_es: # Lo siguiente no coincide, y no está claro que contendrá $1 y $2

source: If the left part is delimited by bracketing punctuation (that is C<()>, C<[]>, C<{}>, or C<< <> >>), the right part needs another pair of delimiters such as C<s(){}> and C<tr[]//>.
es_es: Si la parte izquierda está delimitada por signos de puntuación emparejados (es decir, C<()>, C<[]>, C<{}>, o C<< <> >>), la parte derecha necesita otro par de delimitadores, como en C<s(){}> y C<tr[]//>.
